experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/3/constant/chemistryProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          ode;
    method          singleStep;
}

odeCoeffs
{
    solver          cvode;
    absTol          1e-12;
    relTol          1e-8;
}

chemistry       on;

initialChemicalTimeStep 1e-7;

deltaTMin       1e-9;

deltaTMax       1e-3;

// ************************************************************************* //